# IsValidCategoryForMaterialTakeoff Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSchedule..::..IsValidCategoryForMaterialTakeoff Method
ViewSchedule Class See Also
---
Checks whether a category can be used for a material takeoff.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static bool IsValidCategoryForMaterialTakeoff(
	ElementId categoryId
)
```

Visual Basic
---
```text
Public Shared Function IsValidCategoryForMaterialTakeoff ( _
	categoryId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidCategoryForMaterialTakeoff(
	ElementId^ categoryId
)
```

# ### Parameters
categoryId
    Type: Autodesk.Revit.DB..::..ElementId The category ID to check.
# ### Return Value
True if the category can be used for a material takeoff, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace